# ---
# jupyter:
#   jupytext:
#     text_representation:
#       extension: .py
#       format_name: percent
#       format_version: '1.3'
#       jupytext_version: 1.13.0
#   kernelspec:
#     display_name: Python 3 (ipykernel)
#     language: python
#     name: python3
# ---

# %% [markdown]
# # The Annotated Encoder-Decoder with Attention
#
# Recently, Alexander Rush wrote a blog post called [The Annotated Transformer](http://nlp.seas.harvard.edu/2018/04/03/attention.html), describing the Transformer model from the paper [Attention is All You Need](https://arxiv.org/abs/1706.03762). This post can be seen as a **prequel** to that: *we will implement an Encoder-Decoder with Attention* using (Gated) Recurrent Neural Networks, very closely following the original attention-based neural machine translation paper ["Neural Machine Translation by Jointly Learning to Align and Translate"](https://arxiv.org/abs/1409.0473) of Bahdanau et al. (2015). 
#
# The idea is that going through both blog posts will make you familiar with two very influential sequence-to-sequence architectures. If you have any comments or suggestions, please let me know: [@BastingsJasmijn](https://twitter.com/BastingsJasmijn).

# %% [markdown]
# # Model Architecture
#
# We will model the probability $p(Y\mid X)$ of a target sequence $Y=(y_1, \dots, y_{N})$ given a source sequence $X=(x_1, \dots, x_M)$ directly with a neural network: an Encoder-Decoder.
#
# <img src="images/bahdanau.png" width="636">
#

# End-of-sequence is marked with a "3" here, and padding positions with "1".
#
# +---------------+
# | 4 5 9 8 7 8 3 |
# +---------------+
# | 5 4 8 7 3 1 1 |
# +---------------+
# | 5 8 3 1 1 1 1 |
# +---------------+
# ```
# You can see that, when computing hidden states for this mini-batch, for sentence #2 and #3 we will need to stop updating the hidden state after we have encountered "3". We don't want to incorporate the padding values (1s).
#
# Luckily, PyTorch has convenient helper functions called `pack_padded_sequence` and `pad_packed_sequence`.
# These functions take care of masking and padding, so that the resulting word representations are simply zeros after a sentence stops.
#
# The code below reads in a source sentence (a sequence of word embeddings) and produces the hidden states.
# It also returns a final vector, a summary of the complete sentence, by concatenating the first and the last hidden states (they have both seen the whole sentence, each in a different direction). We will use the final vector to initialize the decoder.

# %% [markdown]
# ### We add the model type in prepration for experiments with different model variants

# %%
from enum import Enum

class ModelType(Enum):
    BIGRU_WITH_ATTENTION = 1
    BILSTM_WITH_ATTENTION = 2
    BIGRU = 3 # A simple BiGRU, i.e. without attention
    BILSTM = 4 # A simple BiLSTM, i.e. without attention


# %%
class Encoder(nn.Module):
    """Encodes a sequence of word embeddings"""
    def __init__(self, input_size, hidden_size, num_layers=1, dropout=0., 
                 model_type:ModelType=ModelType.BIGRU_WITH_ATTENTION):
        super(Encoder, self).__init__()
        self.num_layers = num_layers
        
        if model_type == ModelType.BIGRU_WITH_ATTENTION or model_type == ModelType.BIGRU:
            # The encoder model is the same (GRU) both for BiGRU with attention and without attention
            self.rnn = nn.GRU(input_size, hidden_size, num_layers, 
                              batch_first=True, bidirectional=True, dropout=dropout)
        elif model_type == ModelType.BILSTM_WITH_ATTENTION or model_type == ModelType.BILSTM:
            self.rnn = nn.LSTM(input_size, hidden_size, num_layers, 
                              batch_first=True, bidirectional=True, dropout=dropout)   
        else:
            raise RuntimeError("Error: unknown model type: " + str(model_type))
        
    def forward(self, x, mask, lengths):
        """
        Applies a bidirectional GRU to sequence of embeddings x.
        The input mini-batch x needs to be sorted by length.
        x should have dimensions [batch, time, dim].
        """
        packed = pack_padded_sequence(x, lengths, batch_first=True)
        if isinstance(self.rnn, nn.GRU):
            output, final = self.rnn(packed)
        else:
            #For LSTM type
            output, (final, _) = self.rnn(packed)
        output, _ = pad_packed_sequence(output, batch_first=True)

        # we need to manually concatenate the final states for both directions
        fwd_final = final[0:final.size(0):2]
        bwd_final = final[1:final.size(0):2]
        final = torch.cat([fwd_final, bwd_final], dim=2)  # [num_layers, batch, 2*dim]

        return output, final


# %% [markdown]
# ### Decoder
#
# The decoder is a conditional GRU. Rather than starting with an empty state like the encoder, its initial hidden state results from a projection of the encoder final vector. 
#
# #### Training
# In `forward` you can find a for-loop that computes the decoder hidden states one time step at a time. 
# Note that, during training, we know exactly what the target words should be! (They are in `trg_embed`.) This means that we are not even checking here what the prediction is! We simply feed the correct previous target word embedding to the GRU at each time step. This is called teacher forcing.
#
# The `forward` function returns all decoder hidden states and pre-output vectors. Elsewhere these are used to compute the loss, after which the parameters are updated.
#
# #### Prediction
